Ran Plan for 4 projects:

1. dir: `cloudflare` workspace: `default`
1. dir: `gcp/projects/homelab-ng` workspace: `default`
1. dir: `unifi` workspace: `default`
1. dir: `vault` workspace: `default`
---

### 1. dir: `cloudflare` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.tunnel_folly.data.cloudflare_zero_trust_tunnel_cloudflared_token.this: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! update in-place

Terraform will perform the following actions:

  # cloudflare_zone_dnssec.pulsifer_ca_dnssec will be updated in-place
! resource "cloudflare_zone_dnssec" "pulsifer_ca_dnssec" {
+       algorithm        = (known after apply)
+       digest           = (known after apply)
+       digest_algorithm = (known after apply)
+       digest_type      = (known after apply)
+       ds               = (known after apply)
+       flags            = (known after apply)
        id               = "7b0fdf753795ec69a1318f64be8d2479"
+       key_tag          = (known after apply)
+       key_type         = (known after apply)
+       modified_on      = (known after apply)
+       public_key       = (known after apply)
-       status           = "disabled" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. dir: `gcp/projects/homelab-ng` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.14.0 plan -input=false -refresh -out "/atlantis-data/repos/jonpulsifer/infra/341/default/gcp/projects/homelab-ng/default.tfplan"' in '/atlantis-data/repos/jonpulsifer/infra/341/default/gcp/projects/homelab-ng': exit status 1
data.onepassword_item.cloudflare_api_token: Reading...
data.google_iam_policy.gcs_homelab_ng: Reading...
data.onepassword_item.cloudflare_api_token: Read complete after 0s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/3x5gu5niywi6iza3jxxny7ifsy]
google_service_account.view_counter: Refreshing state... [id=projects/homelab-ng/serviceAccounts/view-counter@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_workload_identity_providers: Refreshing state... [id=projects/homelab-ng/policies/iam.workloadIdentityPoolProviders]
google_org_policy_policy.allow_all_domains: Refreshing state... [id=projects/homelab-ng/policies/iam.allowedPolicyMemberDomains]
google_org_policy_policy.allow_service_accounts: Refreshing state... [id=projects/homelab-ng/policies/iam.disableServiceAccountCreation]
data.google_iam_policy.gcs_homelab_ng: Read complete after 0s [id=3702782091]
google_service_account.terraform: Refreshing state... [id=projects/homelab-ng/serviceAccounts/terraform@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_locations: Refreshing state... [id=projects/homelab-ng/policies/gcp.resourceLocations]
google_service_account.ddnsd: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddnsd-id@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_functions_ingress_settings: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.allowedIngressSettings]
google_org_policy_policy.allowed_cloud_build_worker_pools: Refreshing state... [id=projects/homelab-ng/policies/cloudbuild.allowedWorkerPools]
google_org_policy_policy.allowed_cloud_run_vpc_egress: Refreshing state... [id=projects/homelab-ng/policies/run.allowedVPCEgress]
google_service_account.ddns: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddns-function@homelab-ng.iam.gserviceaccount.com]
google_service_account.vault: Refreshing state... [id=projects/homelab-ng/serviceAccounts/vault-id@homelab-ng.iam.gserviceaccount.com]
google_storage_bucket.vault: Refreshing state... [id=homelab-ng-vault]
google_iam_workload_identity_pool.homelab: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab]
google_org_policy_policy.allow_all_services: Refreshing state... [id=projects/homelab-ng/policies/serviceuser.services]
google_org_policy_policy.allow_functions_without_vpc_connector: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.requireVPCConnector]
google_org_policy_policy.allowed_cloud_run_binauthz: Refreshing state... [id=projects/homelab-ng/policies/run.allowedBinaryAuthorizationPolicies]
google_kms_key_ring.vault: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault]
google_storage_bucket.homelab_ng: Refreshing state... [id=homelab-ng]
google_org_policy_policy.allowed_cloud_run_ingress: Refreshing state... [id=projects/homelab-ng/policies/run.allowedIngress]
google_org_policy_policy.allow_service_account_keys: Refreshing state... [id=projects/homelab-ng/policies/iam.disableServiceAccountKeyCreation]
google_org_policy_policy.allowed_storage_retention_policy_seconds: Refreshing state... [id=projects/homelab-ng/policies/storage.retentionPolicySeconds]
google_storage_bucket.free: Refreshing state... [id=homelab-ng-free]
google_org_policy_policy.allowed_functions_vpc_connector_egress_settings: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.allowedVpcConnectorEgressSettings]
google_service_account.vm: Refreshing state... [id=projects/homelab-ng/serviceAccounts/oldboy@homelab-ng.iam.gserviceaccount.com]
data.google_storage_bucket_objects.files: Reading...
data.google_storage_bucket_objects.files: Read complete after 0s [id=homelab-ng-free]
google_compute_address.oldboy: Refreshing state... [id=projects/homelab-ng/regions/us-east1/addresses/oldboy]
google_service_account.github_actions: Refreshing state... [id=projects/homelab-ng/serviceAccounts/github-actions@homelab-ng.iam.gserviceaccount.com]
google_project_service.service["bigquerystorage.googleapis.com"]: Refreshing state... [id=homelab-ng/bigquerystorage.googleapis.com]
module.network.google_compute_network.network: Refreshing state... [id=projects/homelab-ng/global/networks/vpc]
google_project_service.service["cloudasset.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudasset.googleapis.com]
google_project_service.service["storage-api.googleapis.com"]: Refreshing state... [id=homelab-ng/storage-api.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=homelab-ng/containerregistry.googleapis.com]
google_project_service.service["cloudfunctions.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudfunctions.googleapis.com]
google_project_service.service["iamcredentials.googleapis.com"]: Refreshing state... [id=homelab-ng/iamcredentials.googleapis.com]
google_project_service.service["iap.googleapis.com"]: Refreshing state... [id=homelab-ng/iap.googleapis.com]
google_project_service.service["orgpolicy.googleapis.com"]: Refreshing state... [id=homelab-ng/orgpolicy.googleapis.com]
google_project_service.service["storage-component.googleapis.com"]: Refreshing state... [id=homelab-ng/storage-component.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=homelab-ng/serviceusage.googleapis.com]
google_project_service.service["dns.googleapis.com"]: Refreshing state... [id=homelab-ng/dns.googleapis.com]
google_project_service.service["containeranalysis.googleapis.com"]: Refreshing state... [id=homelab-ng/containeranalysis.googleapis.com]
google_project_service.service["cloudidentity.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudidentity.googleapis.com]
google_project_service.service["logging.googleapis.com"]: Refreshing state... [id=homelab-ng/logging.googleapis.com]
google_project_service.service["cloudbilling.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudbilling.googleapis.com]
google_project_service.service["domains.googleapis.com"]: Refreshing state... [id=homelab-ng/domains.googleapis.com]
google_project_service.service["websecurityscanner.googleapis.com"]: Refreshing state... [id=homelab-ng/websecurityscanner.googleapis.com]
google_project_service.service["container.googleapis.com"]: Refreshing state... [id=homelab-ng/container.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=homelab-ng/compute.googleapis.com]
google_project_service.service["admin.googleapis.com"]: Refreshing state... [id=homelab-ng/admin.googleapis.com]
google_project_service.service["cloudkms.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudkms.googleapis.com]
google_project_service.service["monitoring.googleapis.com"]: Refreshing state... [id=homelab-ng/monitoring.googleapis.com]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudresourcemanager.googleapis.com]
google_project_service.service["binaryauthorization.googleapis.com"]: Refreshing state... [id=homelab-ng/binaryauthorization.googleapis.com]
google_project_service.service["appengine.googleapis.com"]: Refreshing state... [id=homelab-ng/appengine.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=homelab-ng/iam.googleapis.com]
google_project_service.service["maps-backend.googleapis.com"]: Refreshing state... [id=homelab-ng/maps-backend.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=homelab-ng/run.googleapis.com]
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudbuild.googleapis.com]
google_project_service.service["pubsub.googleapis.com"]: Refreshing state... [id=homelab-ng/pubsub.googleapis.com]
google_project_service.service["bigquery.googleapis.com"]: Refreshing state... [id=homelab-ng/bigquery.googleapis.com]
google_project_service.service["oslogin.googleapis.com"]: Refreshing state... [id=homelab-ng/oslogin.googleapis.com]
google_project_service.service["vision.googleapis.com"]: Refreshing state... [id=homelab-ng/vision.googleapis.com]
google_project_iam_member.view_counter_firestore: Refreshing state... [id=homelab-ng/roles/datastore.user/serviceAccount:view-counter@homelab-ng.iam.gserviceaccount.com]
google_project_service.service["groupssettings.googleapis.com"]: Refreshing state... [id=homelab-ng/groupssettings.googleapis.com]
google_project_iam_member.ddnsbot: Refreshing state... [id=homelab-ng/roles/dns.admin/serviceaccount:ddns-function@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.ddnsd_token_creator: Reading...
data.google_iam_policy.terraform_token_creator: Reading...
data.google_iam_policy.gcs_vault: Reading...
google_project_iam_member.ddnsd: Refreshing state... [id=homelab-ng/roles/dns.admin/serviceAccount:ddnsd-id@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.ddnsd_token_creator: Read complete after 0s [id=712373999]
data.google_iam_policy.gcs_vault: Read complete after 0s [id=1208234218]
data.google_iam_policy.terraform_token_creator: Read complete after 0s [id=4001634528]
google_project_iam_member.vault: Refreshing state... [id=homelab-ng/organizations/5046617773/roles/readOnlyVault/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.free: Reading...
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/github]
data.google_iam_policy.free: Read complete after 0s [id=3790195915]
google_iam_workload_identity_pool_provider.vercel: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/vercel]
data.google_iam_policy.github_actions: Reading...
data.google_iam_policy.github_actions: Read complete after 0s [id=1832452650]
google_storage_bucket_iam_policy.homelab_ng: Refreshing state... [id=homelab-ng]
google_compute_image.nixos: Refreshing state... [id=projects/homelab-ng/global/images/nixos]
data.cloudflare_ip_ranges.cloudflare: Reading...
google_project_iam_member.github_actions_function_admin: Refreshing state... [id=homelab-ng/roles/cloudfunctions.admin/serviceAccount:github-actions@homelab-ng.iam.gserviceaccount.com]
google_service_account_iam_member.github_actions_view_counter: Refreshing state... [id=projects/homelab-ng/serviceAccounts/view-counter@homelab-ng.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:github-actions@homelab-ng.iam.gserviceaccount.com]
google_kms_crypto_key.vault: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault]
cloudflare_dns_record.oldboy: Refreshing state... [id=bdbd2fdeee6264229fae1ac8138dff8f]
module.network.google_compute_subnetwork.subnet: Refreshing state... [id=projects/homelab-ng/regions/us-east1/subnetworks/computers]
data.cloudflare_ip_ranges.cloudflare: Read complete after 1s
module.network.google_compute_firewall.ssh: Refreshing state... [id=projects/homelab-ng/global/firewalls/terraform-auto-ssh-firewall]
google_storage_bucket_iam_policy.vault: Refreshing state... [id=b/homelab-ng-vault]
google_service_account_iam_policy.ddnsd_token_creator: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddnsd-id@homelab-ng.iam.gserviceaccount.com]
google_service_account_iam_policy.terraform_token_creator: Refreshing state... [id=projects/homelab-ng/serviceAccounts/terraform@homelab-ng.iam.gserviceaccount.com]
google_storage_bucket_iam_policy.free: Refreshing state... [id=b/homelab-ng-free]
google_service_account_iam_policy.github_actions: Refreshing state... [id=projects/homelab-ng/serviceAccounts/github-actions@homelab-ng.iam.gserviceaccount.com]
google_kms_crypto_key_iam_member.vault_encrypt_decrypt: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
google_kms_crypto_key_iam_member.vault_viewer: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault/roles/cloudkms.viewer/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: Invalid index
│ 
│   on compute.tf line 37, in resource "google_compute_image" "nixos":
│   37:     source = "https://storage.googleapis.com/homelab-ng-free/${data.google_storage_bucket_objects.files.bucket_objects[0].name}"
│     ├────────────────
│     │ data.google_storage_bucket_objects.files.bucket_objects is empty list of object
│ 
│ The given key does not identify an element in this collection value: the
│ collection has no elements.
╵


```
</details>

---
### 3. dir: `unifi` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/jonpulsifer/infra/341/default/unifi/default.tfplan"' in '/atlantis-data/repos/jonpulsifer/infra/341/default/unifi': exit status 1
data.onepassword_item.vault: Reading...
data.onepassword_item.cloudflare_api_token: Reading...
data.onepassword_item.unifi: Reading...
data.onepassword_item.unifi: Read complete after 0s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/lb532zq5efzs3y3xlfbdk2kace]
data.onepassword_item.cloudflare_api_token: Read complete after 0s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/3x5gu5niywi6iza3jxxny7ifsy]
data.onepassword_item.vault: Read complete after 0s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/jjojlizpb5p4slytyw2a4llx3m]
data.unifi_ap_group.all_aps: Reading...
data.unifi_ap_group.lab: Reading...
unifi_static_route.k8s_nodes: Refreshing state... [id=642278bdfaaeac0d1a795b2a]
unifi_user_group.streaming: Refreshing state... [id=625b490306401d04737a5615]
unifi_firewall_group.k8s: Refreshing state... [id=64226f5efaaeac0d1a7958c0]
unifi_user_group.iot: Refreshing state... [id=625b490306401d04737a5610]
unifi_network.lab: Refreshing state... [id=63c2024501b499077fc438d1]
unifi_network.fml: Refreshing state... [id=625b15f5bc00e90631322109]
data.cloudflare_zone.lab: Reading...
unifi_network.starlink: Refreshing state... [id=625b15f5bc00e90631322107]
data.cloudflare_zone.lab: Read complete after 1s [id=6db37c857d0c3631bea427fab3301e89]
unifi_static_route.starlink: Refreshing state... [id=6430fa70c21e410d65df9ea4]
data.unifi_ap_group.lab: Still reading... [10s elapsed]
data.unifi_ap_group.all_aps: Still reading... [10s elapsed]
data.unifi_ap_group.all_aps: Still reading... [20s elapsed]
data.unifi_ap_group.lab: Still reading... [20s elapsed]
data.unifi_ap_group.all_aps: Still reading... [30s elapsed]
data.unifi_ap_group.lab: Still reading... [30s elapsed]
unifi_static_route.k8s_pods: Refreshing state... [id=6425e43dfaaeac0d1a7a2f8a]
unifi_user_group.unmetered: Refreshing state... [id=625b490306401d04737a5613]
data.vault_generic_secret.wifi: Reading...
data.vault_generic_secret.ddns_edge_pulsifer_ca: Reading...
cloudflare_dns_record.k8s_remote_dns["nuc"]: Refreshing state... [id=6b277ed05987a19c03adf51e50d0d9da]
cloudflare_dns_record.k8s_remote_dns["800g2"]: Refreshing state... [id=da8dda02590e5e7b35ba8e917f9ff744]
cloudflare_dns_record.k8s_remote_dns["erx"]: Refreshing state... [id=d1683d2af302d0a4cd45563a7182ecaf]
cloudflare_dns_record.lab_remote_dns["erx-eth0"]: Refreshing state... [id=d14da898745862c241a1eac8436f4b0c]
cloudflare_dns_record.k8s_remote_dns["k8s"]: Refreshing state... [id=bf9bc7c63553ef85a1bc1a924797165d]
cloudflare_dns_record.k8s_remote_dns["optiplex"]: Refreshing state... [id=ec3a60692f97e091d0e7f0508146bc85]
cloudflare_dns_record.lab_remote_dns["screenpi4-wifi"]: Refreshing state... [id=352193f20070d3fe093d488625e5484f]
cloudflare_dns_record.k8s_remote_dns["riptide"]: Refreshing state... [id=c2f69ea6e4fe6571624671aec5be6a9b]
cloudflare_dns_record.lab_remote_dns["blinkypi0"]: Refreshing state... [id=6ea72e0bf933523d3fdcac1c0bf8be9d]
cloudflare_dns_record.lab_remote_dns["pikvm"]: Refreshing state... [id=40665bf2de5558d757e4de843e8839b0]
cloudflare_dns_record.lab_remote_dns["homepi4"]: Refreshing state... [id=278963b0cc15244e543acd75202b9459]
cloudflare_dns_record.lab_remote_dns["nuc-wifi"]: Refreshing state... [id=dd71622f4491c4eb41366fe076bacdde]
cloudflare_dns_record.lab_remote_dns["screenpi4"]: Refreshing state... [id=4cf91c3a06d1a328acaa8d6c5f3896c8]
cloudflare_dns_record.lab_remote_dns["cloudpi4-wifi"]: Refreshing state... [id=82940e8264037d9aaee53d426c957986]
cloudflare_dns_record.lab_remote_dns["speechpi2"]: Refreshing state... [id=43eb15eb18d9c976e15352c67807bfa9]
cloudflare_dns_record.lab_remote_dns["radiopi0"]: Refreshing state... [id=e16e3b3ae9b4ee520d3569491f37905d]
cloudflare_dns_record.lab_remote_dns["homepi4-wifi"]: Refreshing state... [id=a0fc10beca42db0c9425775b0554e42d]
cloudflare_dns_record.lab_remote_dns["cloudpi4"]: Refreshing state... [id=a652c3df96e2ad97160b97420fe4049e]
data.unifi_ap_group.lab: Still reading... [40s elapsed]
data.unifi_ap_group.all_aps: Still reading... [40s elapsed]
data.vault_generic_secret.wifi: Still reading... [10s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [10s elapsed]
data.unifi_ap_group.lab: Still reading... [50s elapsed]
data.unifi_ap_group.all_aps: Still reading... [50s elapsed]
data.vault_generic_secret.wifi: Still reading... [20s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [20s elapsed]
data.unifi_ap_group.lab: Still reading... [1m0s elapsed]
data.unifi_ap_group.all_aps: Still reading... [1m0s elapsed]
data.vault_generic_secret.wifi: Still reading... [30s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [30s elapsed]
data.unifi_ap_group.all_aps: Still reading... [1m10s elapsed]
data.unifi_ap_group.lab: Still reading... [1m10s elapsed]
data.vault_generic_secret.wifi: Still reading... [40s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [40s elapsed]
data.unifi_ap_group.lab: Still reading... [1m20s elapsed]
data.unifi_ap_group.all_aps: Still reading... [1m20s elapsed]
data.vault_generic_secret.wifi: Still reading... [50s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [50s elapsed]
data.unifi_ap_group.lab: Still reading... [1m30s elapsed]
data.unifi_ap_group.all_aps: Still reading... [1m30s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [1m0s elapsed]
data.vault_generic_secret.wifi: Still reading... [1m0s elapsed]
data.unifi_ap_group.all_aps: Still reading... [1m40s elapsed]
data.unifi_ap_group.lab: Still reading... [1m40s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [1m10s elapsed]
data.vault_generic_secret.wifi: Still reading... [1m10s elapsed]
data.unifi_ap_group.all_aps: Still reading... [1m50s elapsed]
data.unifi_ap_group.lab: Still reading... [1m50s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [1m20s elapsed]
data.vault_generic_secret.wifi: Still reading... [1m20s elapsed]
data.unifi_ap_group.lab: Still reading... [2m0s elapsed]
data.unifi_ap_group.all_aps: Still reading... [2m0s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [1m30s elapsed]
data.vault_generic_secret.wifi: Still reading... [1m30s elapsed]
data.unifi_ap_group.all_aps: Still reading... [2m10s elapsed]
data.unifi_ap_group.lab: Still reading... [2m10s elapsed]
data.vault_generic_secret.wifi: Still reading... [1m40s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [1m40s elapsed]
data.unifi_ap_group.all_aps: Still reading... [2m20s elapsed]
data.unifi_ap_group.lab: Still reading... [2m20s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [1m50s elapsed]
data.vault_generic_secret.wifi: Still reading... [1m50s elapsed]
data.unifi_ap_group.all_aps: Still reading... [2m30s elapsed]
data.unifi_ap_group.lab: Still reading... [2m30s elapsed]
data.vault_generic_secret.wifi: Still reading... [2m0s elapsed]
data.vault_generic_secret.ddns_edge_pulsifer_ca: Still reading... [2m0s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # cloudflare_dns_record.lab_remote_dns["homepi4"] will be updated in-place
  ~ resource "cloudflare_dns_record" "lab_remote_dns" {
      ~ comment             = "Updated by ddnsd on 2025-11-11T21:09:55-04:00" -> "terraform managed"
      ~ comment_modified_on = "2025-11-12T01:09:56Z" -> (known after apply)
      ~ content             = "129.222.247.246" -> "10.2.0.22"
        id                  = "278963b0cc15244e543acd75202b9459"
      ~ modified_on         = "2025-11-12T01:09:56Z" -> (known after apply)
        name                = "homepi4.lolwtf.ca"
        tags                = []
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_network.fml,
│   on fml.pulsifer.ca.tf line 10, in resource "unifi_network" "fml":
│   10: resource "unifi_network" "fml" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with data.unifi_ap_group.all_aps,
│   on fml.pulsifer.ca.tf line 32, in data "unifi_ap_group" "all_aps":
│   32: data "unifi_ap_group" "all_aps" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with data.vault_generic_secret.wifi,
│   on fml.pulsifer.ca.tf line 36, in data "vault_generic_secret" "wifi":
│   36: data "vault_generic_secret" "wifi" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_user_group.unmetered,
│   on groups.tf line 1, in resource "unifi_user_group" "unmetered":
│    1: resource "unifi_user_group" "unmetered" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_user_group.iot,
│   on groups.tf line 7, in resource "unifi_user_group" "iot":
│    7: resource "unifi_user_group" "iot" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_user_group.streaming,
│   on groups.tf line 13, in resource "unifi_user_group" "streaming":
│   13: resource "unifi_user_group" "streaming" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_static_route.k8s_nodes,
│   on k8s.tf line 28, in resource "unifi_static_route" "k8s_nodes":
│   28: resource "unifi_static_route" "k8s_nodes" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_static_route.k8s_pods,
│   on k8s.tf line 36, in resource "unifi_static_route" "k8s_pods":
│   36: resource "unifi_static_route" "k8s_pods" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_firewall_group.k8s,
│   on k8s.tf line 44, in resource "unifi_firewall_group" "k8s":
│   44: resource "unifi_firewall_group" "k8s" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with data.unifi_ap_group.lab,
│   on lolwtf.ca.tf line 8, in data "unifi_ap_group" "lab":
│    8: data "unifi_ap_group" "lab" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_network.lab,
│   on lolwtf.ca.tf line 34, in resource "unifi_network" "lab":
│   34: resource "unifi_network" "lab" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_network.starlink,
│   on wan.tf line 5, in resource "unifi_network" "starlink":
│    5: resource "unifi_network" "starlink" {
│ 
╵
╷
│ Error: unable to determine API URL style: Get "https://10.13.37.1": dial tcp 10.13.37.1:443: i/o timeout
│ 
│   with unifi_static_route.starlink,
│   on wan.tf line 26, in resource "unifi_static_route" "starlink":
│   26: resource "unifi_static_route" "starlink" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with data.vault_generic_secret.ddns_edge_pulsifer_ca,
│   on wan.tf line 34, in data "vault_generic_secret" "ddns_edge_pulsifer_ca":
│   34: data "vault_generic_secret" "ddns_edge_pulsifer_ca" {
│ 
╵


```
</details>

---
### 4. dir: `vault` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/jonpulsifer/infra/341/default/vault/default.tfplan"' in '/atlantis-data/repos/jonpulsifer/infra/341/default/vault': exit status 1
data.onepassword_item.google_oauth_client: Reading...
data.onepassword_item.vault: Reading...
data.onepassword_item.google_oauth_client: Read complete after 0s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/ynzbgrzrq3enshs37j72g7enhe]
data.onepassword_item.vault: Read complete after 0s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/jjojlizpb5p4slytyw2a4llx3m]
data.vault_policy_document.godmode: Reading...
data.vault_policy_document.ddnsd: Reading...
data.vault_policy_document.home: Reading...
vault_identity_entity.terraform: Refreshing state... [id=b380bb2c-c5f5-32e3-1de1-6c77ea2a57a1]
vault_auth_backend.approle: Refreshing state... [id=approle]
vault_mount.home: Refreshing state... [id=home]
vault_identity_entity.jawn: Refreshing state... [id=2f718506-1e1c-1c1d-651a-f2d7c5f431e9]
data.vault_policy_document.ddnsd: Read complete after 0s [id=2650925974]
vault_auth_backend.userpass: Refreshing state... [id=userpass]
data.vault_policy_document.home: Read complete after 0s [id=1306023824]
vault_mount.pki: Refreshing state... [id=pki]
data.vault_policy_document.godmode: Read complete after 0s [id=4107383416]
vault_auth_backend.gcp: Refreshing state... [id=gcp]
vault_policy.home: Refreshing state... [id=home]
vault_policy.ddnsd: Refreshing state... [id=ddnsd]
vault_jwt_auth_backend.google: Refreshing state... [id=google]
vault_policy.godmode: Refreshing state... [id=godmode]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: context deadline exceeded
│ 
│   with vault_auth_backend.approle,
│   on auth-approles.tf line 1, in resource "vault_auth_backend" "approle":
│    1: resource "vault_auth_backend" "approle" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_auth_backend.gcp,
│   on auth-gcp.tf line 1, in resource "vault_auth_backend" "gcp":
│    1: resource "vault_auth_backend" "gcp" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_auth_backend.userpass,
│   on auth-userpass.tf line 1, in resource "vault_auth_backend" "userpass":
│    1: resource "vault_auth_backend" "userpass" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_jwt_auth_backend.google,
│   on auth.google.tf line 6, in resource "vault_jwt_auth_backend" "google":
│    6: resource "vault_jwt_auth_backend" "google" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_identity_entity.jawn,
│   on entities.tf line 1, in resource "vault_identity_entity" "jawn":
│    1: resource "vault_identity_entity" "jawn" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_identity_entity.terraform,
│   on entities.tf line 10, in resource "vault_identity_entity" "terraform":
│   10: resource "vault_identity_entity" "terraform" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_mount.home,
│   on mounts.tf line 1, in resource "vault_mount" "home":
│    1: resource "vault_mount" "home" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_mount.pki,
│   on pki-fml.tf line 1, in resource "vault_mount" "pki":
│    1: resource "vault_mount" "pki" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_policy.ddnsd,
│   on policy-ddnsd.tf line 9, in resource "vault_policy" "ddnsd":
│    9: resource "vault_policy" "ddnsd" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_policy.godmode,
│   on policy-godmode.tf line 9, in resource "vault_policy" "godmode":
│    9: resource "vault_policy" "godmode" {
│ 
╵
╷
│ Error: context deadline exceeded
│ 
│   with vault_policy.home,
│   on policy-home.tf line 9, in resource "vault_policy" "home":
│    9: resource "vault_policy" "home" {
│ 
╵
Releasing state lock. This may take a few moments...

```
</details>

---
### Plan Summary

4 projects, 1 with changes, 0 with no changes, 3 failed